[
  {
    "name": "Chapitre bonus - les limites de chatgpt",
    "comment": "Malgré une explication claire de ses besoins, parfois chatgpt ne saura pas vous guider correctement, exemple: \n \n Avec mes 2,3 bases en dev web (appris pendant le confinement) je me lance dans un nouveau projet, créer mon site pour partager mes discussions les plus pertinentes avec chatgpt. \n \n Pour le front-end je me débrouille et même je me fais kiffer car ça faisait longtemps, donc je code ma structure, la pimp comme je veux et réunis mon contenu, le publie sur mon github et le mets en ligne grâce à son service de pages, puis je me dis, un espace commentaire serait cool. \n \n Alors je me demande si je dois recoder mon site en php, rallumer mon vieux serveur MAMP et créer ma base de données en SQL... mais la flemme, \n \n 1 ça fait un bail donc je vais certainement galérer, \n \n 2 je n'ai pas envie de passer mon weekend là-dessus. \n \n Alors je vais voir mon pote chatgpt qui est toujours prêt à m'aider, qu'importe l'heure. Et je lui expose ce que je veux faire, comme d'hab il me répond du tac au tac sans hésitation et sans 'heuuuu' de mec qui cherche sa réponse. \n \n Il est 7H34, c'est parti pour une matinée à apprendre de nouvelles compétences en sa compagnie. Midi, j'arrive à déployer mon site sur un autre service après avoir galéré à comprendre le fonctionnement du back-end (les dev back, vous êtes des oufs). Bref, tout avance, d'une simple github page (site en ligne) j'arrive à un bordel sans nom qui ne fonctionne pas. \n \n Je fais une pause, puis on reprend sur du SEO (référencement). Bim bam boum, j'apprends encore plein de trucs, je suis trop content, les sites de référencement me donnent une note de 92/100, je kiffe, je sais pertinemment que vous trouverez mon site à la 54ème page Google, mais moi ça me va. \n \n Puis on reprend le taf pour mon espace commentaire, la matinée se transforme en une journée, puis deux, puis trois (j'avais dit au départ que je voulais pas passer mon week-end à ça 🤔). Je te passe les détails mais évidemment, il me fait passer par 40 services, à chaque fois je le reprends en lui rappelant que je voulais un truc simple sans me faire chier à ça, sinon j'aurais tapé mon php direct et il me dit 't'inquiète on y arrive' 😂. Bon, t'as compris qu'en fait il n'avait rien compris, et forcé de constater que je n'arriverais pas à mes fins, j'efface toute la mémoire de mon pote et reprends la même question 5 jours après (pour rappel, le site est toujours au même niveau mais mon repo github est ras la geu** 😅). \n \n\n \n Et voilà, pas qu'il m'annonce que sans service tiers à Netlify, je n'aurais jamais d'espace commentaire dynamique et je m'aperçois que je n'avais en fait rien compris au fonctionnement back d'un site (je t'avais dit que j'étais teubé ?) \n \n\n \nConclusion : ChatGPT est un partenaire puissant dans la quête de réponses et de solutions. Cependant, croire qu'il peut remplacer complètement l'intelligence humaine, c'est un peu comme attendre qu'un marteau monte un meuble tout seul.\n \n\n \nL'illusion de la solution facile : L'IA promet de simplifier nos vies et de rendre le processus de création plus rapide. Mais cette promesse cache un piège : la solution facile n'existe pas. Chaque outil, même aussi puissant que ChatGPT, vient avec des défis et des obstacles. Le plus important, ce n'est pas d'éviter les difficultés, mais d'apprendre à les surmonter. Si l'IA nous aide à gagner du temps, elle ne remplace pas l'investissement personnel nécessaire pour comprendre et maîtriser ce qu'on entreprend.\n \nCe n'est pas un substitut à l'expérience, à l'apprentissage, et encore moins à l'esprit critique. L'IA doit être vue comme un complément de notre propre expertise, un outil qui étend nos capacités, mais qui ne peut jamais remplacer ce qui fait de nous des humains : la capacité à résoudre des problèmes de manière originale, à réfléchir au-delà des algorithmes et à apprendre de nos erreurs.",
    "date": "2024-12-30"
  }
]
